10/data/attachments/5fa53316bdf64264.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Amanda_spring_Friend_76803_4</nif:username>
            <nif:friendToBeRequested>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>